CREATE DATABASE  IF NOT EXISTS `stdmgr` /*!40100 DEFAULT CHARACTER SET utf8 */;
USE `stdmgr`;
-- MySQL dump 10.13  Distrib 5.7.9, for Win64 (x86_64)
--
-- Host: localhost    Database: stdmgr
-- ------------------------------------------------------
-- Server version	5.5.60

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `ral_detail`
--

DROP TABLE IF EXISTS `ral_detail`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `ral_detail` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `name` varchar(10) NOT NULL,
  `amount` int(11) NOT NULL,
  `grade` varchar(10) NOT NULL,
  `term` int(4) NOT NULL,
  `number` int(4) DEFAULT NULL,
  `requirement` mediumtext,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=13 DEFAULT CHARSET=utf8 COMMENT='奖助贷信息表 ';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `ral_detail`
--

LOCK TABLES `ral_detail` WRITE;
/*!40000 ALTER TABLE `ral_detail` DISABLE KEYS */;
INSERT INTO `ral_detail` VALUES (1,'华软奖学金',3000,'大一',2018,100,'(A)具有下列条件之一者:\\n1、全年必修课基本分90分以上，并名列专业第一名；\\n2、全年各科成绩均在90分以上;\\n3、应届毕业生大学期间全部课程基本分90分以上，单科成绩80分以上;\\n4、代表学院参加省级以上专业比赛(文体除外)获冠军或一等奖(2人以上的团队,以团队为代表学院参加省级以上专业比赛(文体除外)获冠军或一等奖(2人以上的团队,以团队为为评选单位,奖金由团队分配)及以上奖项,且全年课程学业基本分在75分(含75分)以上(2人以上的团队,团队每个成员的全年课程学业基本分在75分(含75分)以上)。\\n(B)注重个人素质与品德培养\\n(一)具有爱国爱校的思想和行为,严格遵守国家法律法规,遵守《广州大学华软软件学院学生手册》和华软学院各项规章制度。有良好的公共道德和个人修养,作风正派,热爱劳动,爱护公物,讲究卫生,积极维护校园的文明卫生环境和正常的学习、生活秩序。\\n(二)学习勤奋刻苦,态度端正,全学年无旷课,无补考;有钻研和创新精神;积极参与课堂教学和研讨,按时完成书面作业和实验报告;有一定的分析、解决问题的能力,积极参加科技、学术活动。\\n(三)尊敬老师,关心他人,与同学友好相处,有较好的群众基础,作风正派,勇于开展批评与自我批评,有团队精神;积极参加集体、社会实践和青年志愿者活动,并且表现出色。\\n(四)积极参加文体活动和第二课堂活动。\\n(五)一学年里未受过通报批评(含通报批评)以上的处理或处分。\\n(六)一学年里未受过党团内通报批评(含通报批评)以上的处理或处分。'),(2,'学生一等奖学金',1800,'大一',2018,100,'(一)学生奖学金的评选条件:\\n1、具有爱国爱校的思想和行为,严格遵守国家法律法规,遵守《广州大学华软软件学院学生手册》和华软学院各项规章制度。有良好的公共道德和个人修养,作风正派,热爱劳动,爱护公物,讲究卫生,积极维护校园的文明卫生环境和正常的学习、生活秩序。\\n2、学习勤奋刻苦,态度端正,有钻研和创新精神;积极参与课堂教学和研讨,按时完成书面作业和实验报告;有一定的分析、解决问题的能力,积极参加科技、学术活动。\\n3、尊敬老师,关心他人,与同学友好相处,勇于开展批评与自我批评,有团队精神;积极参加集体、社会实践和青年志愿者活动,并且表现出色。\\n4、积极参加文体活动和第二课堂活动。\\n5、一学年内期末考试各课程(含必修和选修课)成绩全部及格。\\n6、一学年里未受过通报批评(含通报批评)以上的处理或处分。\\n7、一学年里未受过党团内通报批评(含通报批评)以上的处理或处分。\\n8、在综合测评中诚实守信,不弄虚作假。\\n(二)学生一等奖学金的评选办法:\\n获奖比例为本系本年级本专业人数的3%,参评学生条件为综合测评总分排名居专业前5%;'),(7,'学生二等奖学金',1000,'大一',2018,200,'(一)学生奖学金的评选条件:\\n1、具有爱国爱校的思想和行为,严格遵守国家法律法规,遵守《广州大学华软软件学院学生手册》和华软学院各项规章制度。有良好的公共道德和个人修养,作风正派,热爱劳动,爱护公物,讲究卫生,积极维护校园的文明卫生环境和正常的学习、生活秩序。\\n2、学习勤奋刻苦,态度端正,有钻研和创新精神;积极参与课堂教学和研讨,按时完成书面作业和实验报告;有一定的分析、解决问题的能力,积极参加科技、学术活动。\\n3、尊敬老师,关心他人,与同学友好相处,勇于开展批评与自我批评,有团队精神;积极参加集体、社会实践和青年志愿者活动,并且表现出色。\\n4、积极参加文体活动和第二课堂活动。\\n5、一学年内期末考试各课程(含必修和选修课)成绩全部及格。\\n6、一学年里未受过通报批评(含通报批评)以上的处理或处分。\\n7、一学年里未受过党团内通报批评(含通报批评)以上的处理或处分。\\n8、在综合测评中诚实守信,不弄虚作假。\\n(二)学生二等奖学金的评选办法:\\n获奖比例为本系本年级本专业人数的6%,参评学生条件为综合测评总分排名居专业前15%;'),(8,'学生三等奖学金',800,'大一',2018,300,'(一)学生奖学金的评选条件:\\n1、具有爱国爱校的思想和行为,严格遵守国家法律法规,遵守《广州大学华软软件学院学生手册》和华软学院各项规章制度。有良好的公共道德和个人修养,作风正派,热爱劳动,爱护公物,讲究卫生,积极维护校园的文明卫生环境和正常的学习、生活秩序。\\n2、学习勤奋刻苦,态度端正,有钻研和创新精神;积极参与课堂教学和研讨,按时完成书面作业和实验报告;有一定的分析、解决问题的能力,积极参加科技、学术活动。\\n3、尊敬老师,关心他人,与同学友好相处,勇于开展批评与自我批评,有团队精神;积极参加集体、社会实践和青年志愿者活动,并且表现出色。\\n4、积极参加文体活动和第二课堂活动。\\n5、一学年内期末考试各课程(含必修和选修课)成绩全部及格。\\n6、一学年里未受过通报批评(含通报批评)以上的处理或处分。\\n7、一学年里未受过党团内通报批评(含通报批评)以上的处理或处分。\\n8、在综合测评中诚实守信,不弄虚作假。\\n(二)学生三等奖学金的评选办法:\\n获奖比例为本系本年级本专业人数的10%,参评学生条件为综合测评总分排名居本专业前25%。'),(9,'单项奖励金',400,'大一',2018,20,'在过去一学年度内参加国际、国家、部省、市等的科技、文体、艺术、学科竞赛获奖为学院争光的学生团体或个人;'),(10,'企业奖学金',1000,'大一',2018,10,'学院审定,名额和奖励金额由企业自定。'),(11,'个人奖学金',1000,'大一',2018,5,'个人奖学金管理条例由该项奖学金评选委员会判定。'),(12,'国家助学贷款',6000,'大一',2018,500,'1、普通全日制在校学生,具有中华人民共和国国籍,持有中华人民共和国居民身份证。\\n2、具有完全民事行为能力(未满十八周岁的未成年人申请国家助学贷款须由其法定监护人书面同意)。\\n3、遵守国家法律、法规和学校的规章制度,诚实守信,道德品质良好。');
/*!40000 ALTER TABLE `ral_detail` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2018-08-31  2:44:56
